<?php

/**Έλεγχος εάν έχει γίνει υποβολή της φόρμας dispSingleCsv_btn.
Αν έχει γίνει υποβολή της φόρμας, ελέγχει αν έχει επιλεγεί αρχείο.
Αν έχει επιλεγεί αρχείο, λαμβάνει τα δεδομένα της επικεφαλίδας από το επιλεγμένο αρχείο CSV και τα δεδομένα από το επιλεγμένο αρχείο CSV.

Τα δεδομένα της επικεφαλίδας αποθηκεύονται στη μεταβλητή $headerDataR.
Τα δεδομένα από το αρχείο CSV αποθηκεύονται στη μεταβλητή $csvDatasR.
Η λειτουργικότητα αυτή είναι υπεύθυνη για την εμφάνιση των δεδομένων από ένα επιλεγμένο αρχείο CSV όταν ο χρήστης πατάει το κουμπί "Display file" */

if(isset($_POST['dispSingleCsv_btn'])){ // Έλεγχος εάν έχει γίνει υποβολή της φόρμας
    
    $headerDataR=[] ; 
    $csvDatasR = []; 
    
    if($selectedFile != null ){ // Έλεγχος εάν έχει επιλεγεί αρχείο
        // Λήψη των δεδομένων της επικεφαλίδας από το επιλεγμένο αρχείο CSV
        $headerDataR = $csvProssesor->headerInfo($selectedFile);
        // Λήψη των δεδομένων από το επιλεγμένο αρχείο CSV
        $csvDatasR = array_merge($csvProssesor->getDataCsv($selectedFile));
    }
}

?>
